<a href="https://colab.research.google.com/github/rajasreekalli/datascience-dojo/blob/main/average_height_exercise.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [30]:
import pandas as pd

In [31]:
filename = '/content/drive/MyDrive/athleteEventsNoPersonal.csv'    
df = pd.read_csv(filename)

In [32]:
# 1.a. How many rows?
print("Total number of row:", df.shape[0])
# 1.b. How many columns?
print("Total number of Columns:", df.shape[1])

Total number of row: 40616
Total number of Columns: 12

In [33]:
# 1.c. Which columns have missing values?
df['Medal'].isna().sum()
# Why do think there are there so many null values in the Medals column? Because they haven't won any medals.

34699

In [34]:
df.isna().sum()

ID            0
Age        1473
Height     9001
Team          0
NOC           0
Games         0
Year          0
Season        0
City          0
Sport         0
Event         0
Medal     34699
dtype: int64

In [35]:
# 1.d. How many entries correspond to the city of London?
df['City'].value_counts().London

3370

In [36]:
# 1.e. What age is the youngest athlete in our sample data?  Hint: use min()
df['Age'].min()

11.0

In [37]:
# 2.a. How many athletes who participated in the Sport "Tug-Of-War" were from Team "Sweden" in our sample dataset?
filt = (df['Team'] == 'Sweden') & (df['Sport'] == 'Tug-Of-War')
df[filt]

          ID   Age  Height  ...       Sport                        Event   Medal
10023  34205  22.0     NaN  ...  Tug-Of-War  Tug-Of-War Men's Tug-Of-War     NaN
12681  43105  23.0     NaN  ...  Tug-Of-War  Tug-Of-War Men's Tug-Of-War  Bronze
13015  44087  29.0   182.0  ...  Tug-Of-War  Tug-Of-War Men's Tug-Of-War  Bronze
16250  55169  23.0     NaN  ...  Tug-Of-War  Tug-Of-War Men's Tug-Of-War     NaN
19048  64266  21.0     NaN  ...  Tug-Of-War  Tug-Of-War Men's Tug-Of-War     NaN
20550  68647  26.0   190.0  ...  Tug-Of-War  Tug-Of-War Men's Tug-Of-War  Bronze

[6 rows x 12 columns]

In [38]:
# 2.b. How many Gold medals were awarded to athletes who were over 40 years old?
athletes_over_40 = (df['Age'] > 40) & (df['Medal'] == 'Gold')
df = df.loc[athletes_over_40,:]
df['Medal'].value_counts(dropna = False)

Gold    66
Name: Medal, dtype: int64

In [39]:
# 3.Determine the average height of: 
# a.All rows included.
df['Height'].mean(axis=0)

173.3125

In [40]:
 # 3. b. All rows included, but grouped by Event
df.groupby(['Event','Height'])['Height'].mean()

Event                                            Height
Archery Women's Individual                       167.0     167.0
Equestrianism Men's Three-Day Event, Team        175.0     175.0
Equestrianism Mixed Jumping, Team                164.0     164.0
                                                 175.0     175.0
Equestrianism Mixed Three-Day Event, Individual  175.0     175.0
Equestrianism Mixed Three-Day Event, Team        175.0     175.0
                                                 181.0     181.0
Fencing Men's Sabre, Team                        179.0     179.0
Rowing Men's Coxed Eights                        170.0     170.0
Sailing Mixed 10 metres                          180.0     180.0
Sailing Mixed 12 metres                          163.0     163.0
                                                 178.0     178.0
Sailing Mixed Three Person Keelboat              180.0     180.0
Shooting Men's Rapid-Fire Pistol, 25 metres      164.0     164.0
                                                 168.0     168.0
Name: Height, dtype: float64

In [41]:
  # 3.c
one_per_athlete = df.drop_duplicates(subset = 'ID', keep = 'first')
df['Height'].mean(axis=0)

173.3125